performance_test_wrk.txt
wrk -t4 -c40 -d3s http://127.0.0.1:88/gunicorn

Running 3s test @ http://127.0.0.1:88/gunicorn
  4 threads and 40 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms    1.44ms  21.63ms   88.38%
    Req/Sec    11.14k     3.47k   24.90k    75.83%
  133327 requests in 3.01s, 43.48MB read
  Non-2xx or 3xx responses: 133327
Requests/sec:  44227.36
Transfer/sec:     14.42MB



wrk -t8 -c40 -d3s http://127.0.0.1:88/gunicorn

Running 3s test @ http://127.0.0.1:88/gunicorn
  8 threads and 40 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms    1.68ms  23.31ms   89.11%
    Req/Sec     5.16k     2.01k   30.97k    92.53%
  124023 requests in 3.10s, 40.45MB read
  Non-2xx or 3xx responses: 124023
Requests/sec:  39983.46
Transfer/sec:     13.04MB