performance_test_wrk.txt
wrk -t4 -c40 -d3s http://127.0.0.1:88/gunicorned
Running 3s test @ http://127.0.0.1:88/gunicorned
  4 threads and 40 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.72ms    4.73ms  46.63ms   79.41%
    Req/Sec   374.36     69.78     1.06k    97.52%
  4512 requests in 3.10s, 0.91MB read
Requests/sec:   1455.93
Transfer/sec:    299.94KB